SUBJECTS_EMOJIS = {
    # ==== Languages ====
    "Иностранный язык": "🌐",
    "Немецкий": "🇩🇪",
    "Китайский": "🇨🇳",
    "Японский": "🇯🇵",
    "Русский": "🇷🇺",
    "Французский": "🇫🇷",
    "Испанский": "🇪🇸",
    "Английский": "🇬🇧",
    # ==== Other ====
    "Экономика": "💲",
    "История": "⏳",
    "Астрономия": "🔭",
    "Математика": "🔢",
    "Физическая": "🏋️",
    "Информатика": "💻",
    "География": "🌍",
    "Физика": "🔬",
    "Психология": "🧠",
    "Литература": "📚",
    "Робототехника": "🤖",
    "Культура": "🎭",
    "Химия": "🧪",
    "Предпринимательство": "💼",
    "Право": "⚖️",
    "Биология": "🧬",
    "Технология": "🛠️",
    "ИЗО": "🎨",
    "Экология": "🌱",
    "Обществознание": "👥",
    "ОБЖ": "🚑",
    "Искусство": "🖼️",
}
DEFAULT_SUBJECT_EMOJI = "📚"

OK_EMOJI = "✅"
CANCEL_EMOJI = "❌"
EMPTY_EMOJI = "⏺️"
BACK_EMOJI = "⬅️"
NEXT_EMOJI = "➡️"
EXIT_EMOJI = "🚪"
QUESTION_EMOJI = "❓"
START_EMOJI = "👋"
SUBMIT_EMOJI = "📨"
SEARCH_EMOJI = "🔍"
FILTERS_EMOJI = "🔧"
FILTER_NAME_EMOJI = "📝"
FILTER_SUBJECTS_EMOJI = "📚"
FILTER_LEVELS_EMOJI = "📊"
FILTER_GRADES_EMOJI = "👨‍🎓"
FILTER_BY_DATE_EMOJI = "📅"

RESET_EMOJI = "🔄"

LINK_EMOJI = "🔗"